#+TITLE: Standard Input and Output (stdio.h)
** Caracteres ordinarios
   - Son sólo caracteres comunes (que no son caracter espacio en blanco, debajo explico más en detalle cuales)
   - Se diferencian de las especificaciones de conversión porque no contienen el %
   - Los *white space characters* (espacios en blanco) son
     - \t tabulación
     - \n nueva linea
     - \r carriage return (retorno de carro) "hace que se mueva el cursor a la primera posición de una línea"
     - \v tabulación vertical "hace un salto de linea y tabulación de la misma longitud que la palabra anterior a \v
     - tabulación vertical
     - el caracter de espacio en blanco
     - 
  #+name: Ejemplos de usar \t \n \r
  #+BEGIN_SRC C :results output
    #include <stdio.h>

    int main(){
      char *s;

      // PROBANDO - CARRIAGE RETURN
      //
      // esto va a imprimir la cadena de caracteres "bien jaja"
      // porque posiciona el cursor al comienzo de esta nueva linea
      //
      // Obs: Se suele complementar con \n es decir el caracter de nueva linea
      s ="hola\rcomo estas\rbien jaja";
      printf("%s", s);

      // otro ejemplo seria este
      // 1. Hace un salto de linea con tabulación (por el \v)
      // 2. Pero en vez de hacer tabulación a partir del número uno,
      // hace que el cursor apunte al principio de linea (vuelve el cursor atrás, al principio)
      s  = "0 \v 0 \v 0 \v 0\v\r1 2 3 4\n";
      printf("%s", s);

      /************************************************/

      // PROBANDO - TABULACION VERTICAL
      //
      s = "0 0 0\v1\v2\v3\v4\v5 6 7 8 9";
      printf("%s", s);

      return 0;
    }
  #+END_SRC
  
  #+RESULTS: Ejemplos de usar \t \n \r
  : holacomo estasbien jaja0  0  0  01 2 3 4
  : 0 0 012345 6 7 8 9

  #+BEGIN_SRC C :results output
    #include <stdio.h>

    int main(){
      printf("hola probando...(?");

      return 0;
    }
  #+END_SRC

  #+RESULTS:
  : hola probando...(?

  #+BEGIN_EXAMPLE
  Carriage return means to return to the beginning of the current line without advancing downward.
  The name comes from a printer's carriage, as monitors were rare when the name was coined.
  This is commonly escaped as \r, abbreviated CR, and has ASCII value 13 or 0x0D.

  Linefeed means to advance downward to the next line; however, it has been repurposed and renamed.
  Used as "newline", it terminates lines (commonly confused with separating lines).
  This is commonly escaped as \n, abbreviated LF or NL, and has ASCII value 10 or 0x0A.
  CRLF (but not CRNL) is used for the pair \r\n.

  Form feed means advance downward to the next "page". It was commonly used as page separators, 
  but now is also used as section separators. (It's uncommonly used in source code to divide logically 
  independent functions or groups of functions.) Text editors can use this character 
  when you "insert a page break". This is commonly escaped as \f, abbreviated FF, 
  and has ASCII value 12 or 0x0C
  #+END_EXAMPLE

  #+name: Ejemplo de \r carriage return
  #+BEGIN_EXAMPLE
  r is carriage return and moves the cursor back like if i will do-
  Ej.:
  printf("stackoverflow\rnine")
  ninekoverflow

  means it has shifted the cursor to the beginning of "stackoverflow" and overwrites 
  the starting four characters since "nine" is four character long
  #+END_EXAMPLE

  #+name: ejemplo de \n new line
  #+BEGIN_EXAMPLE
  \n is new line character which changes the line and takes the cursor to the beginning of a new line like-

  printf("stackoverflow\nnine")
  stackoverflow
  nine
  #+END_EXAMPLE

  #+name: ejemplo de \f form feed
  #+BEGIN_EXAMPLE
  \f is form feed, its use has become obsolete but it is used for giving indentation like

  printf("stackoverflow\fnine")
  stackoverflow
               nine
  #+END_EXAMPLE

*** Ejemplos 1

    #+BEGIN_SRC C :results output
      #include <stdio.h>

      int main(){
        printf("..%-010s..\n", "hola");
        printf("..%010s..\n", "hola");
        printf("%010c", 1);

        return 0;
      }
    #+END_SRC

    #+RESULTS:
    : ..hola      ..
    : ..      hola..
    :          

    #+BEGIN_SRC C
      for (int x = 0; x < 300; x += 9) {
        printf("|%10d|\n", x); // lo alinea por defecto a la derecha a mnos q usemos el simbolo -
       }
    #+END_SRC

** Ejemplos
   #+name: archivo_input
   #+BEGIN_SRC bash :results none
   echo "12" > input.txt # es el numero que ingresara en otros archivos como input
   #+END_SRC
   
   #+name: Ejemplo - printf/fprintf y scanf/fscanf
   #+BEGIN_SRC C :results output :var tmp=archivo_input :cmdline < input.txt
     #include <stdio.h>

     int main(){
       // el printf() es la manera abreviada de usar fprintf()
       printf("hola..!\n");
       // le pasamos como flujo de salida, la pantalla de la terminal
       fprintf(stdout, "hola..!\n");

       /***********************************************************/

       int x;
       // el scanf() es la manera corta de usar fscanf()
       scanf("%d", &x);
       printf("el valor es %d\n", x);

       // le asignamos como flujo de entrada, el teclado
       fscanf(stdin, &x);
       printf("el valor es %d\n", x);

       return 0;
     }
   #+END_SRC

   #+RESULTS: Ejemplo - printf/fprintf y scanf/fscanf
   : hola..!
   : hola..!
   : el valor es 12
   : el valor es 12

    #+name: Ejemplo - stdin como archivo
    #+BEGIN_SRC C :resuts output :var tmp=archivo_input :cmdline < input.txt
          #include <stdio.h>

          int main(){
            FILE *archivo;
            // utilizamos stdin como archivo
            // stdin es una macro
            // que será lo que se ingrese por teclado
            archivo = stdin;

            // es donde se guardará la información
            int x;

            printf("Ingrese un número: ");
            // fscanf() funciona similar al scanf()
            // - fscanf() tiene como estandar de entrada a un fichero
            // - scanf() tiene como estandar de entrada al teclado
            fscanf(archivo, "%d", &x);
            printf("El número ingresado fue %d\n", x);

            return 0;
          }
   #+END_SRC

   #+RESULTS: Ejemplo - stdin como archivo
   : Ingrese un número: El número ingresado fue 12
   
   #+name: Ejemplo - stdout como archivo
   #+BEGIN_SRC C :results output
     #include <stdio.h>

     int main(){
       FILE *archivo;
       archivo = stdout; // stdout es una macro, por default es la pantalla de la terminal
       // la propia pantalla de la terminal también es un archivo

       // fprintf() funciona casi igual que printf()
       // en fprintf() el flujo de salida (stream) suele ser un archivo
       // en printf() el flujo de salida es la pantalla de la terminal
       fprintf(archivo, "Probando..!\n");


       return 0;
     }
   #+END_SRC

   #+RESULTS:
   : Probando..!
   
** scanf
   - El tipo es un entero
   - Retorna la cantidad de asignaciones exitosas (es decir las que no tuvieron un error al guardar en los punteros)
   - Son exitosas las que si se esperaba un entero %d, se ingresó un entero
   - El *primer parámetro* al igual que printf() tiene las *espeficaciones de conversión* y *caracteres*
     - Las *especificaciones de conversión* comienzan con un % seguido del tipo de conversión
   - El segundo parámetro recibe el *operador elipsis* ... el de los tres puntos
     - Quiere decir que recibirá uno o más parámetros
     - Los parámetros deben ser *punteros* que son donde se almacenarán los input

   #+name: El prototipo de scanf
   #+BEGIN_EXAMPLE
   int scanf(char* format, ...)
   #+END_EXAMPLE
 
   #+NAME: input_scanf_file
   #+BEGIN_SRC bash :results none :exports none
     echo "10 12" > input.txt
     # si le pasara solo un valor de entrada en vez de 2,
     # el scanf() retornaría un 1, diciendo que solo uno de los input tuvo exito
   #+END_SRC

   #+NAME: Ejemplo de scanf
   #+BEGIN_SRC C :results output :var tmp=input_scanf_file :cmdline < input.txt
     #include <stdio.h>

     int main(){
       int a[10], b[10];
       // - si ingresamos 1 2, el resultado será 2,
       // - si ingresamos 1 a, el resultado será 1
       // scanf() devuelve la cantidad argumentos que tuvieron éxito (es decir que no tuvieron error)
       printf("%d\n", scanf("%d%d", a,b));

       return 0;
     }
   #+END_SRC

   #+RESULTS: Ejemplo de scanf
   : 2
** sscanf
   - Implementa lo mismo que el scanf() pero con un tercer parámetro, que va antes de *format
   - El primer parámetro suplanta la *entrada estandar* (input) que suele ser la del teclado

   #+name: Ejemplo sscanf
   #+BEGIN_SRC C :results output
     #include <stdio.h>

     int main(){

       char cadenaA[10];
       char cadenaB[10];

       // scanf(char* string, char* format, ...)
       // - Primer parámetro será el input (estamos reemplazando la entrada standar que era el teclado)
       // - Segundo parámetro, donde se guardan las especificaciones de conversión y caracteres ordinarios
       // - El resto de los parámetros son los punteros donde se guardaran las especificaciones de conversión
       sscanf("hola che", "%s %s", cadenaA, cadenaB);

       // imprimimos por separado para comprobar
       printf("cadenaA: %s\n", cadenaA);
       printf("cadenaB: %s\n", cadenaB);
       // imprimimos todo junto
       printf("%s %s\n",cadenaA, cadenaB);

       return 0;
     }
   #+END_SRC

   #+RESULTS:
   : cadenaA: hola
   : cadenaB: che
   : hola che

** printf
   - Según su prototipo, este retorna un entero
     - Es la cantidad de caracteres del primer parámetro, lo que se imprimirá por pantalla
   - Recibe como primer argumento una cadena de caracteres (se logra con un puntero)
     - Es el formato con el que se imprimirá por pantalla (es la salida ó output predeterminada)
     - Con fmt se refiere formato
     - Hace las conversiones de los parámetros. Estan precedidas del % seguido del tipo de conversión (entero,caracter,etc..)
   - Recibe como seguno parámetro el operador elipsis ... que son tres puntos seguidos
     - El operador ... significa que recibirá uno o muchos parámetros.

   #+NAME: Prototipo de printf()
   #+BEGIN_EXAMPLE
   int printf(char *fmt, ...) 
   #+END_EXAMPLE

   #+NAME: Ejemplo - Conversiones
   #+BEGIN_SRC C
     #include <stdio.h>

     int main(){
       char* texto = "hola";
       char pepe = 'a';
       //printf(pepe);
       printf(":%5s:\n", texto);
       printf(":%.10s:\n", texto);
       printf(":%-15s:\n", texto);
       printf(":%10.15s:\n", texto);
       printf(":%-10.15s:\n", texto);

       return 0;
     }
   #+END_SRC

   #+RESULTS: Probando
   | :      | hola: |
   | :hola: |       |
   | :hola  | :     |
   | :      | hola: |
   | :hola  | :     |

   #+NAME: Probando
  #+BEGIN_SRC C
     #include <stdio.h>

     int main(){
       // - printf devuelve la longitud de caracteres del primer parámetro
       // - también incluye los espacios
       // - y los %formatos_de_conversion (que cuentan por un caracter)

       printf("printf 2: %d\n", printf("110 %d%d", 5, 2));

       return 0;
     }
   #+END_SRC

   #+RESULTS:
   : 110 52printf 2: 6
